# KingNeverInOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..KingNeverInOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId KingNeverInOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KingNeverInOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ KingNeverInOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace